#include <stdio.h>
#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");
/*Ромб - это четырехугольник, у которого все стороны равны
  Квадрат это ромб  хотя бы с одним прямым углом*/
																

	int x[4], y[4], i,dl[6];
	for (i = 0; i < 4; i++)  //Ввод координат точек
	{
		cout << "Введите x " << i + 1 << " точки"<<endl;
		cin >> x[i];
		cout << "Введите y " << i + 1 << " точки"<<endl;
		cin >> y[i];
	}
	dl[0] = (x[1] - x[0])*(x[1] - x[0]) + (y[1] - y[0])*(y[1] - y[0]);     //AB
	dl[1] = (x[2] - x[1])*(x[2] - x[1]) + (y[2] - y[1])*(y[2] - y[1]);     //BC
	dl[2] = (x[3] - x[2])*(x[3] - x[2]) + (y[3] - y[2])*(y[3] - y[2]);     //CD
	dl[3] = (x[3] - x[0])*(x[3] - x[0]) + (y[3] - y[0])*(y[3] - y[0]);     //AD
	dl[4] = (x[2] - x[0])*(x[2] - x[0]) + (y[2] - y[0])*(y[2] - y[0]);     //AC
	dl[5] = (x[3] - x[1])*(x[3] - x[1]) + (y[3] - y[1])*(y[3] - y[1]);     //BD
		if (dl[0] == 0 || dl[1] == 0 || dl[2] == 0 || dl[3] == 0 || dl[4] == 0 || dl[5] == 0)// Есть ли совпадающие точки
		cout << "Есть совпадающие точки";
		else
	{
			i = 0;
			if ((x[1] - x[0]) * (y[2] - y[0]) == (y[1] - y[0]) * (x[2] - x[0]))i++; //A B C на одной прямой
			if ((x[1] - x[0]) * (y[3] - y[0]) == (y[1] - y[0]) * (x[3] - x[0]))i++; //A B D на одной прямой
			if ((x[2] - x[0]) * (y[3] - y[0]) == (y[2] - y[0]) * (x[3] - x[0]))i++; //A C D на одной прямой
			if ((x[2] - x[1]) * (y[3] - y[1]) == (y[2] - y[1]) * (x[3] - x[1]))i++; //B C D на одной прямой
			//Выполнится или только одно условие или ни одно или все сразу
	}
		if(i) cout << "Как минимум три точки лежат на одной прямой" << endl;
	
	    else                               //Является ли четырехугольник квадратом, проверяя равенство 4 сторон и хотя бы 1 прямой угол
	{
		i = 0;
		if (dl[0] == dl[1] && dl[1] == dl[2] && dl[2] == dl[3] && (x[1] - x[0]) * (x[3] - x[0]) + (y[1] - y[0]) * (y[3] - y[0]) == 0) i++;
		if (dl[1] == dl[3] && dl[3] == dl[4] && dl[4] == dl[5] && (x[2] - x[0]) * (x[3] - x[0]) + (y[2] - y[0]) * (y[3] - y[0]) == 0) i++;
		if (dl[0] == dl[2] && dl[2] == dl[4] && dl[4] == dl[5] && (x[1] - x[0]) * (x[2] - x[0]) + (y[1] - y[0]) * (y[2] - y[0]) == 0) i++;
		if (i) cout << "Квадрат" << endl;
		else cout << "Не является квадратом" << endl;	
	}
	system("pause");
		
}

